# Series objective in the 1 d labelled  array

In [3]:
import pandas as pd

In [4]:
s1=pd.Series([1,2,3,4,5])

In [5]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
type(s1)

pandas.core.series.Series

# series value can be indexed  and change to its value

In [7]:
s2=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [8]:
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

# we can also create a a series obj from the dict

In [9]:
s3=pd.Series({'a':10,'b':20,'c':30})

In [10]:
s3

a    10
b    20
c    30
dtype: int64

# We can change the index position

In [11]:
pd.Series({'a':10,'b':20,'c':30}, index=['b','c','d','a'])

b    20.0
c    30.0
d     NaN
a    10.0
dtype: float64

# Creating a dataframe

In [12]:
import pandas as pd

# Create the DataFrame with 10 values in each column
df1 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah", "Ian", "Jack"],
    "Marks": [85, 92, 78, 90, 88, 76, 95, 89, 84, 91],
    "Address": ["NY", "LA", "SF", "TX", "FL", "NV", "WA", "OR", "MI", "PA"],
    "Numbers": [12345, 67890, 23456, 78901, 34567, 89012, 45678, 90123, 56789, 12390],
    "Ages": [15, 16, 15, 17, 16, 15, 17, 16, 15, 16]
})

print(df1)

      Name  Marks Address  Numbers  Ages
0    Alice     85      NY    12345    15
1      Bob     92      LA    67890    16
2  Charlie     78      SF    23456    15
3    David     90      TX    78901    17
4      Eva     88      FL    34567    16
5    Frank     76      NV    89012    15
6    Grace     95      WA    45678    17
7   Hannah     89      OR    90123    16
8      Ian     84      MI    56789    15
9     Jack     91      PA    12390    16

In [13]:
df1.head()

      Name  Marks Address  Numbers  Ages
0    Alice     85      NY    12345    15
1      Bob     92      LA    67890    16
2  Charlie     78      SF    23456    15
3    David     90      TX    78901    17
4      Eva     88      FL    34567    16

In [14]:
df1.sample(10)

      Name  Marks Address  Numbers  Ages
1      Bob     92      LA    67890    16
5    Frank     76      NV    89012    15
7   Hannah     89      OR    90123    16
2  Charlie     78      SF    23456    15
8      Ian     84      MI    56789    15
0    Alice     85      NY    12345    15
4      Eva     88      FL    34567    16
9     Jack     91      PA    12390    16
6    Grace     95      WA    45678    17
3    David     90      TX    78901    17

In [15]:
df1.tail()

     Name  Marks Address  Numbers  Ages
5   Frank     76      NV    89012    15
6   Grace     95      WA    45678    17
7  Hannah     89      OR    90123    16
8     Ian     84      MI    56789    15
9    Jack     91      PA    12390    16

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     10 non-null     object
 1   Marks    10 non-null     int64
 2   Address  10 non-null     object
 3   Numbers  10 non-null     int64
 4   Ages     10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 528.0+ bytes

In [17]:
df1.describe()

          Marks       Numbers       Ages
count  10.00000     10.000000  10.000000
mean   86.80000  51115.100000  15.800000
std     6.08824  30027.060849   0.788811
min    76.00000  12345.000000  15.000000
25%    84.25000  26233.750000  15.000000
50%    88.50000  51233.500000  16.000000
75%    90.75000  76148.250000  16.000000
max    95.00000  90123.000000  17.000000

In [18]:
df1.describe(include="all")

         Name     Marks Address       Numbers       Ages
count      10  10.00000      10     10.000000  10.000000
unique     10       NaN      10           NaN        NaN
top     Alice       NaN      NY           NaN        NaN
freq        1       NaN       1           NaN        NaN
mean      NaN  86.80000     NaN  51115.100000  15.800000
std       NaN   6.08824     NaN  30027.060849   0.788811
min       NaN  76.00000     NaN  12345.000000  15.000000
25%       NaN  84.25000     NaN  26233.750000  15.000000
50%       NaN  88.50000     NaN  51233.500000  16.000000
75%       NaN  90.75000     NaN  76148.250000  16.000000
max       NaN  95.00000     NaN  90123.000000  17.000000

In [19]:
df1.shape

(10, 5)

In [20]:
df1.memory_usage(deep=True) # it provides the space  of each variable into bytes

Index      128
Name       616
Marks       80
Address    590
Numbers     80
Ages        80
dtype: int64

In [21]:
df1.dtypes

Name       object
Marks       int64
Address    object
Numbers     int64
Ages        int64
dtype: object

In [22]:
df1.to_excel('student.xlsx',index=False)

KeyboardInterrupt

In [ ]:
! pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\acer\anaconda3\lib\site-packages (3.1.5)

[notice] A new release of pip is available: 25.1.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: et-xmlfile in c:\users\acer\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

In [ ]:
df1.to_excel('student.xlsx',index=False)

ModuleNotFoundError: No module named 'openpyxl'

In [ ]:
df1.to_csv('student.xlsx',index=False)

In [ ]:
# Save as CSV
df1.to_csv('student.csv', index=False)